/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   stream_and_file.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mdelphia <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/12/10 11:42:00 by mdelphia          #+#    #+#             */
/*   Updated: 2019/12/10 11:42:03 by mdelphia         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "sh42.h"
// для создания файла или, просто, его открытие
int			stream_and_file(t_pars_list *list)
{
	if (list->stream_list)
		if (redirect_stream(list->stream_list))
			return (-1);
	return (0);
}
